Revit 2027 API
ParameterTypeId.RebarHookAngle Property
 "Hook Angle"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarHookAngle { get; }
Public Shared ReadOnly Property RebarHookAngle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarHookAngle {
	ForgeTypeId^ get ();
}
static member RebarHookAngle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace